import React, {Component} from "react";
import "./css/normal.css"; // 引入样式文件

class History extends Component {
    render() {
        return (
            <div className="container">
                <div className="text-content">
                    <h1>秦汉</h1>
                    <p>扎染“秦汉始有之”（工仪实录），已有数千年历史，这支古代染缬中的奇葩，
                        一直以自己独特而奇妙的美姿根深蒂固生长在人民中间，点缀、美化人民的生活。
                        朴实无华，天然成趣的扎染这支古老的染缬奇葩，必将在中原大地重放光彩，更加绚丽。</p>
                    <h1>盛唐</h1>
                    <p>在南北朝时，扎染产品被广泛用于妇女的衣着，在“搜神后记”中就有“紫缬襦”（即上衣）、“青裙”的记载，
                        而“紫缬襦”就是指有“鹿胎缬”花纹的上衣。唐代是我国古代文化鼎盛时期，绞缬的纺织品甚为流行、更为普遍，
                        在唐诗中我们可看到当时妇女流行的装扮就是穿“青碧缬”，着“平头小花草履”。
                        在宫廷更是广泛流行花纹精美的绞缬绸，“青碧缬衣裙”成为唐代时尚的基本式样。
                        史载盛唐时，扎染技术传入日本等国，日本将我国的扎染工艺视作国宝，至今在日本的东大寺内，
                        还保存着我国唐代的五彩绞缬。后经日本又流传入我国云南，由于云贵地区的水资源丰富，气候温和，
                        所以古老的扎染工艺在那里落户。唐贞元十六年，南诏舞队到长安献艺，所着舞衣“裙襦鸟兽草木，文以八彩杂革”即为扎染而成。</p>
                    {/* <h1>宋代</h1>
                    <p>扎染技法的采用。使面料富于变化，既有朴实浑厚的原始类，又有变换流动的现代美，具有中国画水墨韵味的美和神奇的朦胧美，
                        扎染服装是立足民族文化的既传统有现代的服装艺术创作。夹染、抓染、线串染及叠染等出现各种不同的纹路效果。
                        在同一织物上运用多次扎结、多次染色的工艺，可使传统的扎染工艺由单色发展为多种色彩的效果。
                        古时候染料一般用植物染料，亦称草木染。常用的染料有红花，紫草，蓝靛等。那时候的扎染技法有米染，面染，豆染等。
                        即用豆面，石灰调成防染桨，通过花板涂在布上，然后煮染，可出现兰底白花的效果。
                        根据设计图案的效果，用线或绳子以各种方式绑扎布料或衣片，放入染液中，绑扎处因染料无法渗入而形成自然特殊图案的一种印花方法。
                        也可将成形的服装直接扎染。分串扎和撮扎两种方式。前者图案犹如露珠点点、文静典雅，后者图案色彩对比强烈、活泼清新。
                        一般可用来做较为宽松服装、围巾等。多选用丝绸面料。</p>
                    <h1>明清</h1>
                    <p>明清时期，染织技艺已到达很高的水平，出了染布行会，明朝洱海卫红布、清代喜洲布和大理布均是名噪一时的畅销产品。
                        至民国时期，居家扎染已十分普遍，以一家一户为主的扎染作坊密集著称的周城、喜洲等乡镇，已经成为名传四方的扎染中心。</p> */}
                
                
                </div>
                <div className="half-circle"></div>
            </div>
        );
    }
}




export default History;